In [4]:
import pandas as pd 
import numpy as np

In [6]:
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [14]:
df.to_csv('output.csv', index=True)

In [15]:
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [16]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [21]:
mask = df['Age'] > 30

In [22]:
df[mask]

      Name  Age     City
2  Charlie   35  Chicago

In [23]:
df['Salary'] = [50000, 60000, 70000]

In [24]:
df

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [26]:
mask = ( df['Age'] > 30 )  &  ( df['Salary'] > 60000 )

In [27]:
mask

0    False
1    False
2     True
dtype: bool

In [28]:
df[mask]

      Name  Age     City  Salary
2  Charlie   35  Chicago   70000

In [29]:
df.drop('Salary', axis=1 )

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [30]:
df

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [35]:
df.drop('Salary', axis = 1, inplace=True )

In [36]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [37]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [42]:
df = pd.read_csv('./employee.csv')

In [43]:
df

      name        address     phone
0    Alice    123 Main St  555-1234
1      Bob  456 Maple Ave  555-5678
2  Charlie     789 Oak Dr  555-8765

In [55]:
data = {
    'Nom': ['Alice', 'Bob', 'Charlie', 'David'],
    'Âge': [24, 30, 22, 35],
    'Ville': ['Paris', 'Lyon', 'Marseille', 'Bordeaux']
}

Persons = pd.DataFrame(data)
Persons

       Nom  Âge      Ville
0    Alice   24      Paris
1      Bob   30       Lyon
2  Charlie   22  Marseille
3    David   35   Bordeaux

In [51]:
df = pd.read_csv('./employee.csv')

In [52]:
df

      name        address     phone
0    Alice    123 Main St  555-1234
1      Bob  456 Maple Ave  555-5678
2  Charlie     789 Oak Dr  555-8765

In [54]:
df

      name        address     phone
0    Alice    123 Main St  555-1234
1      Bob  456 Maple Ave  555-5678
2  Charlie     789 Oak Dr  555-8765

In [57]:
mask = Persons['Âge'] > 25

In [58]:
Persons[mask]

     Nom  Âge     Ville
1    Bob   30      Lyon
3  David   35  Bordeaux

In [60]:
Persons['Salary'] = [50000, 60000, 55000, 70000]

In [61]:
Persons

       Nom  Âge      Ville  Salary
0    Alice   24      Paris   50000
1      Bob   30       Lyon   60000
2  Charlie   22  Marseille   55000
3    David   35   Bordeaux   70000

In [63]:
Persons

       Nom  Âge      Ville  Salary
0    Alice   24      Paris   50000
1      Bob   30       Lyon   60000
2  Charlie   22  Marseille   55000
3    David   35   Bordeaux   70000

In [64]:
Persons

       Nom  Âge      Ville  Salary
0    Alice   24      Paris   50000
1      Bob   30       Lyon   60000
2  Charlie   22  Marseille   55000
3    David   35   Bordeaux   70000

In [67]:
Persons['Salary'] = Persons['Salary']* 1.1

In [68]:
Persons

       Nom  Âge      Ville   Salary
0    Alice   24      Paris  55000.0
1      Bob   30       Lyon  66000.0
2  Charlie   22  Marseille  60500.0
3    David   35   Bordeaux  77000.0

In [69]:
Persons.iloc[0,1]

24

In [70]:
Persons.loc[0, 'Âge']

24

In [71]:
Persons.iloc[:2, :2]

     Nom  Âge
0  Alice   24
1    Bob   30